<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads FreeMind dmg from sourceforge.
By  default downloads latest version</string>
	<key>Identifier</key>
	<string>com.github.prochat.download.freemind</string>
	<key>Input</key>
	<dict>
		<key>DOWNLOAD_URL</key>
		<string>https://www.mirrorservice.org/sites/ftp.sourceforge.net/pub/sourceforge/f/fr/freemind</string>
		<key>INDEX_URL</key>
		<string>https://sourceforge.net/projects/freemind/files/</string>
		<key>NAME</key>
		<string>FreeMind</string>
		<key>SEARCH_PATTERN_URL</key>
		<string>title="(?P&lt;url&gt;.*\.dmg):.*"</string>
		<key>SEARCH_PATTERN_VERSION</key>
		<string>title="/freemind/(?P&lt;url2&gt;[\.0-9]*)/.*\.dmg.*"</string>
		<key>USER_AGENT</key>
		<string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_3) AppleWebKit/536.28.10 (KHTML, like Gecko) Version/6.0.3 Safari/536.28.10</string>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>%SEARCH_PATTERN_URL%</string>
				<key>request_headers</key>
				<dict>
					<key>user-agent</key>
					<string>%USER_AGENT%</string>
				</dict>
				<key>url</key>
				<string>%INDEX_URL%</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
				<key>request_headers</key>
				<dict>
					<key>user-agent</key>
					<string>%USER_AGENT%</string>
				</dict>
				<key>url</key>
				<string>%DOWNLOAD_URL%%match%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>%SEARCH_PATTERN_VERSION%</string>
				<key>request_headers</key>
				<dict>
					<key>user-agent</key>
					<string>%USER_AGENT%</string>
				</dict>
				<key>result_output_var_name</key>
				<string>dversion</string>
				<key>url</key>
				<string>%INDEX_URL%</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
