<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads FreeMind dmg from sourceforge.
By  default downloads latest version</string>
	<key>Identifier</key>
	<string>com.github.prochat.FreeMind.download</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>FreeMind</string>
       	<key>INDEX_URL</key>
       	<string>http://sourceforge.net/projects/freemind/files/</string>
		<key>DOWNLOAD_URL</key>
       	<string>http://www.mirrorservice.org/sites/ftp.sourceforge.net/pub/sourceforge/f/fr/freemind</string>
       	<key>SEARCH_PATTERN_URL</key>
		<string>title="(?P&lt;url&gt;.*\.dmg):.*"</string>	
        <key>USER_AGENT</key>
        <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_3) AppleWebKit/536.28.10 (KHTML, like Gecko) Version/6.0.3 Safari/536.28.10</string>		
	</dict>
	<key>Process</key>
	<array>
	 	<dict>
			<key>Processor</key>
           		<string>URLTextSearcher</string>
           		<key>Arguments</key>
            		<dict>
                		<key>url</key>
                		<string>%INDEX_URL%</string>
                		<key>re_pattern</key>
                		<string>%SEARCH_PATTERN_URL%</string>
		               	<key>request_headers</key>
		                <dict>
		                        <key>user-agent</key>
		                        <string>%USER_AGENT%</string>
		                </dict>
            		</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%DOWNLOAD_URL%%match%</string>
				<key>filename</key>
				<string>%NAME%.dmg</string>
               	<key>request_headers</key>
                <dict>
                        <key>user-agent</key>
                        <string>%USER_AGENT%</string>
                </dict>
				
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
