<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download Aseba disk image and build a package.</string>
    <key>Identifier</key>
    <string>com.github.prochat.pkg.aseba</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Aseba</string>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.prochat.download.aseba</string>
    <key>Process</key>
    <array>
 		

	</array>
</dict>
</plist>

