<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest LeJOS-EV3 and imports into Munki.
	</string>
	<key>Identifier</key>
	<string>com.github.prochat.munki.LeJOS-EV3</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_CATEGORY</key>
		<string>Developer Tools</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/LeJOS-EV3</string>
		<key>NAME</key>
		<string>LeJOS-EV3</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.prochat.pkg.LeJOS-EV3</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
