<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Packages the download of LeJOS-EV3.</string>
	<key>Identifier</key>
	<string>com.github.prochat.LeJOS-EV3.pkg</string>
	<key>Input</key>
    <dict>
		<key>NAME</key>
		<string>LeJOS-EV3</string>
    </dict>
	<key>ParentRecipe</key>
	<string>com.github.prochat.LeJOS-EV3.download</string>
	<key>Process</key>
    <array>
	<dict>
	 	<key>Comment</key>
	    <string>Unarchive downloaded stuff</string>
	    <key>Processor</key>
	    <string>Unarchiver</string>
	    <key>Arguments</key>
	    <dict>
		<key>archive_path</key>
		<string>%pathname%</string>
		<key>destination_path</key>
		<string>%RECIPE_CACHE_DIR%/app/%NAME%</string>
		<key>purge_destination</key>
		<true/>
	    </dict>
	</dict>
	<dict>
	 	<key>Comment</key>
	    <string>Create the package root</string>
	    <key>Processor</key>
	    <string>PkgRootCreator</string>
	    <key>Arguments</key>
	    <dict>
		<key>pkgroot</key>
		<string>%RECIPE_CACHE_DIR%/%NAME%</string>
		<key>pkgdirs</key>
		<dict>
		    <key>Applications</key>
		    <string>0775</string>
		</dict>
	    </dict>
	</dict>
	<dict>
	 	<key>Comment</key>
	    <string>Copy files from source to root</string>
	    <key>Processor</key>
	    <string>Copier</string>
	    <key>Arguments</key>
	    <dict>
		<key>source_path</key>
		<string>%destination_path%/</string>
		<key>destination_path</key>
		<string>%pkgroot%/Applications/%NAME%</string>
	    </dict>
	</dict>
	</array>
</dict>
</plist>