<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest LeJOS-EV3 and imports into Munki.
	</string>
	<key>Identifier</key>
	<string>com.github.prochat.LeJOS-EV3.munki</string>
	<key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/LeJOS-EV3</string>
        <key>NAME</key>
        <string>LeJOS-EV3</string>
        <key>BRANCH</key>
        <string>release</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>LeJOS-EV3 let's you programm EV3 LEGO bricks in Java. The brick must be pre-installed</string>
            <key>display_name</key>
            <string>LeJOS-EV3</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
	<key>ParentRecipe</key>
	<string>com.github.prochat.LeJOS-EV3.download</string>
   	<key>Process</key>
    <array>	
		<dict>
		 	<key>Comment</key>
		    <string>Unarchive downloaded stuff</string>
		    <key>Processor</key>
		    <string>Unarchiver</string>
		    <key>Arguments</key>
		    <dict>
			<key>archive_path</key>
			<string>%pathname%</string>
			<key>destination_path</key>
			<string>%RECIPE_CACHE_DIR%/%NAME%/</string>
			<key>purge_destination</key>
			<true/>
		    </dict>
		</dict>
	    <dict>
	 		<key>Processor</key>
	     	<string>DmgCreator</string>
	       	<key>Arguments</key>
	       	<dict>
	         	<key>dmg_root</key>
	         	<string>%RECIPE_CACHE_DIR%/%NAME%</string>
	          	<key>dmg_path</key>
	          	<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
	     	</dict>
		</dict>
	  	<!--dict>
	      	<key>Arguments</key>
	      	<dict>
	          	<key>pkg_path</key>
	          	<string>%dmg_path%</string>
	          	<key>repo_subdirectory</key>
	          	<string>%MUNKI_REPO_SUBDIR%</string>
	      	</dict>
	      	<key>Processor</key>
	      	<string>MunkiImporter</string>
		</dict-->
	</array>
</dict>
</plist>
