<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest LeJOS-EV3 and imports into Munki.
	</string>
	<key>Identifier</key>
	<string>com.github.prochat.LeJOS-EV3.munki</string>
	<key>Input</key>
    <dict>
        <key>NAME</key>
        <string>LeJOS-EV3</string>
        <key>MUNKI_CATEGORY</key>
        <string>Developer Tools</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/LeJOS-EV3</string>
        <!--key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
              	<string>testing</string>
            </array>
            <key>description</key>
            <string>LeJOS-EV3 let's you programm EV3 LEGO bricks in Java. The brick must be pre-installed</string>
            <key>display_name</key>
            <string>LeJOS-EV3</string>
            <key>name</key>
            <string>LeJOS-EV3</string>
            <key>unattended_install</key>
            <true/>
        </dict-->
    </dict>
	<key>ParentRecipe</key>
	<string>com.github.prochat.LeJOS-EV3.pkg</string>
   	<key>Process</key>
    <array>	
	  	<dict>
      		<key>Processor</key>
      		<string>MunkiImporter</string>
	      	<key>Arguments</key>
	      	<dict>
	          	<key>pkg_path</key>
	          	<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
	          	<key>repo_subdirectory</key>
	          	<string>%MUNKI_REPO_SUBDIR%</string>
	      	</dict>
		</dict>
	</array>
</dict>
</plist>
