<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Logger Pro is a data-collection software
	The installation of an update needs a previous licensed version</string>
	<key>Identifier</key>
	<string>com.github.prochat.munki.loggerpro_update</string>
    <key>Input</key>
    <dict>
        <key>DISPLAY_NAME</key>
        <string>LoggerPro_Update</string>
        <key>NAME</key>
        <string>LoggerPro_Update</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>%NAME%</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Logger Pro is a data-collection software</string>
            <key>display_name</key>
            <string>%DISPLAY_NAME%</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>developer</key>
            <string>vernier.com</string>
            <key>category</key>
            <string>Science</string>
			<key>version</key>
			<string>1.1</string>
        </dict>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.prochat.pkg.loggerpro_update</string>
    <key>Process</key>
    <array>
    <dict>
         <key>Arguments</key>
         <dict>
             <key>pkg_path</key>
             <string>%pkg_path%</string>
             <key>repo_subdirectory</key>
             <string>%MUNKI_REPO_SUBDIR%</string>
         </dict>
         <key>Processor</key>
         <string>MunkiImporter</string>
     </dict>
	</array>
</dict>
</plist>

