<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Logger Pro is a data-collection software
	The installation of an update needs a previous licensed version</string>
	<key>Identifier</key>
	<string>com.github.prochat.munki.loggerpro_update</string>
    <key>Input</key>
    <dict>
        <key>DISPLAY_NAME</key>
        <string>LoggerPro_Update</string>
        <key>NAME</key>
        <string>LoggerPro_Update</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>%NAME%</string>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.prochat.pkg.loggerpro_update</string>
    <key>Process</key>
    <array>
    <dict>
    	<key>Processor</key>
    	<string>MunkiImporter</string>
        <key>Arguments</key>
        <dict>
             <key>pkg_path</key>
             <string>%NAME%.pkg</string>
             <key>repo_subdirectory</key>
             <string>%MUNKI_REPO_SUBDIR%</string>
			 <key>version_comparison_key</key>
			 <string>version</string>
			 <key>pkginfo</key>
			 <dict>
				<key>version</key>
				<string>%dversion%</string>
			 </dict>
        </dict>
     </dict>
	</array>
</dict>
</plist>

