<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download LoggerPro Update disk image and build a package.</string>
    <key>Identifier</key>
    <string>com.github.prochat.pkg.loggerpro_update</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>LoggerPro_Update</string>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.prochat.download.loggerpro_update</string>
    <key>Process</key>
    <array>
    <dict>
        <key>Processor</key>
        <string>PkgCopier</string>
        <key>Arguments</key>
        <dict>
            <key>source_pkg</key>
            <string>%pathname%/Logger*</string>
        </dict>
    </dict>
	</array>
</dict>
</plist>

